# NameNum

## Description
Function NameNum returns the number of different object names in the active Vectorworks document.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION NameNum : LONGINT;
```

```python

def vs.NameNum():
    return LONGINT
```

## Version
Availability: from MiniCAD
## Category
* Object Names